# 使用KNN分类算法实现根据（身高和体重）对体型进行分类

from sklearn.neighbors import KNeighborsClassifier    # 导入KNN分类算法包

My_tall_weight_train = [
    [180, 50], [180, 65], [180, 90], [180, 95], [180, 55],
    [168, 57], [176, 65], [163, 48], [182, 80], [159, 51],
    [175, 90], [165, 50], [185, 100], [160, 45], [180, 95],
    [170, 55], [190, 105], [155, 40], [176, 85], [162, 48],
    [172, 60], [195, 110], [158, 42], [182, 94], [168, 52],
    [178, 80], [150, 35], [188, 98], [157, 43], [173, 68],
    [165, 37], [188, 70], [175, 80], [183, 88], [162, 45],
    [176, 75], [168, 58], [158, 41], [179, 82], [170, 50],
    [187, 97], [152, 38], [169, 62], [181, 92], [172, 56],
    [191, 103], [157, 44], [174, 78], [164, 49], [184, 90]
]

My_tall_weight_biaoqian_train = [
    '偏瘦', '标准', '偏胖', '偏胖', '偏瘦',
    '标准', '标准', '偏瘦', '偏胖', '偏瘦',
    '偏胖', '偏瘦', '偏胖', '偏瘦', '偏胖',
    '标准', '偏胖', '偏瘦', '偏胖', '偏瘦',
    '标准', '偏胖', '偏瘦', '偏胖', '标准',
    '偏胖', '偏瘦', '偏胖', '偏瘦', '标准',
    '偏瘦', '标准', '标准', '偏胖', '偏瘦',
    '标准', '偏瘦', '偏胖', '偏瘦', '标准',
    '偏胖', '偏瘦', '偏胖', '偏瘦', '偏胖',
    '标准', '偏瘦', '偏胖', '偏瘦', '偏胖'
]

# 实例化knn对象
knn = KNeighborsClassifier(n_neighbors=5)
# n_neighbors:就是k-NN的k的值，选取最近的k个点。

knn.fit(My_tall_weight_train, My_tall_weight_biaoqian_train)
# knn.fit(x_train.y_train)使用k-近邻算法对训练数据集x_train和对应的标签y_rain进行拟合。

My_test = [[172, 40], [172, 50], [172, 60]]

My_pre = knn.predict(My_test)
print(My_pre)





